import 'package:get/get.dart';
class myLocal implements Translations{

  @override
  Map<String, Map<String, String>> get keys => {
    'ar' : {  '1':'الصفحة الرئيسية','2' :'مستخدم','3':'خبير','4':'تسجيل دخول','5':'الايميل','6':'كلمة السر','7':'تسجيل الدخول','8':'ليس لديك حساب','9':'تسجيل الدخول','10':'الايميل لا يجب ان يكون فارغ','11':'كلمة السر لا يجب ان تكون فارغة',
      '12':'تسجيل الدخول','13':'الايميل','14':'كلمة السر','15':'تسجيل دخول','16':'ليس لديك حساب','17':'تسجل دخول','18':'الايميل لا يجب ان يكون فارغ ','19':'كلمة السر لا يجب ان يكون فارغ','20':'تسجيل الخروج',
      '21':'مستخدم','23':'الاسم','24':'الاسم لا يجب ان يكون فارغ','25':'الايميل','26':'الايميل لا يجب ان يكون فارغ','27':'كلمة السر','28':'كلمة السر لا يجب ان تكون فارغة','29':'تأكيد كلمة السر','30':'تأكيد كلمة السر لا يجب أن تكون فارغة','31':'تسجيل الدخول',
      '32'  : ' الاسم','33': 'الإيميل', '34':'كلمة السر', '35': 'تأكيد كلمة السر','36':'الخبرات','37':'العنوان','38'  : 'الرقم ','39': 'الأيام المتاحة', '40':'تسجيل الدخول', '41': 'خبير','42':'السبت','43':'الأحد','44':'الإثنين','45':'الثلاثاء','46':'الأربعاء','47':'الخميس','48':'الجمعة','49':'الاستديو','50':'الكاميرا',
    },
    'en':  { '1':'Homepage','2': 'user','3': 'Expert','4':'LOG IN','5':'Email','6':'Password','7':'log in','8':'Register','9':'LOG IN','10':'Email must not be empty ','11':'Password must not be empty',
     '12':'LOG IN','13':'Email','14':'Password','15':'log in','16':'Register','17':'LOG IN','18':'Email must not be empty ','19':'Password must not be empty','20':'LOG OUT',
      '21':'USER','23':'Name','24':'Name must not be empty','25':'Email','26':'Email must not be empty','27':'Password','28':'Password must not be empty','29':'Confirm Password','30':'Confirm Password must not be empty','31':'LOG IN',
     '32'  : ' Name','33': 'Email', '34':'Password', '35': 'confirm Password','36':'Experiences','37':'Address','38'  : 'Number ','39': 'Available Days', '40':'Log In', '41': 'Expert','42':'Saturday','43':'Sunday','44':'Monday','45':'Tuesday','46':'Wednesday','47':'Thursday','48':'Friday','49':'Gallery','50':'Camera',

    },
  };

 const myLocal();
}